Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སྤྱི་བོའི་གཙུག་ཏོར་གྱི་གསེབ་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མཚན་དམ་པ་དང་། དཔེ་བྱད་བཟང་པོ་རྣམ་པར་དག་པས་བརྒྱན་པ། འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་རི་བོ་ཤིན་ཏུ་འབར་བ་ལྟར་སྣང་བ་འོད་ཀྱི་དཀྱིལ་འཁོར་ཕྱོགས་བཅུར་སྤ་ཞིང་ཚད་མེད་པར་འབར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཚུལ་གྱིས་རྒྱས་པར་འགེངས་པའི་དབྱངས་མངའ་བ། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་སྟོན་པ་འགྲོ་བ་ཐམས་ཅད་ལ་ཐ་མི་དད་པར་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་འབེབས་པ་སྟེ། འདི་ལྟར་སྙིང་པོ་བྱང་ཆུབ་མཆོག་ཏུ་ཕྱིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞིའི་བྱེ་བྲག་མངོན་སུམ་དུ་ཤེས་པའི་སྤྲིན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བ་ཐོབ་པ་རྣམས་ལ་གཞི་ཀུན་ཏུ་རྟེན་པའི་སྤྲིན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཆེན་པོའི་རྒྱལ་ཚབ་ཏུ་དབང་བསྐུར་བ་རྣམས་ལ་སྒོ་ཀུན་ནས་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཞོན་ནུར་གྱུར་པ་རྣམས་ལ་ཀུན་ནས་བརྒྱན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་།
en: Sudhana also saw issuing forth, from within Sāgara­dhvaja’s uṣṇīṣa on the crown of his head, the bodies of tathāgatas who were as numerous as the atoms in countless buddha realms and were adorned by the pure signs and features of a great being; who shone like a mountain of Jambu River gold; whose halos shone measurelessly, radiating into the ten directions; whose voices filled the ways of the realm of phenomena, demonstrating the limitless miraculous power of the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོའི་ཚོགས་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་དག་པ་རྣམས་ལ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་གྱི་བྱེ་བྲག་ཤེས་པའི་རྡོ་རྗེ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་སྦྱོར་བ་དང་ལྡན་པ་རྣམས་ལ་འགྲོ་བ་ཡོངས་སུ་སྡུད་པས་ཀུན་ནས་བརྒྱན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆེར་སྐྱེས་པ་རྣམས་ལ་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པའི་དཀྱིལ་འཁོར་མངོན་སུམ་དུ་དམིགས་པའི་སྤྲིན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣལ་འབྱོར་ལ་སྤྱོད་པ་རྣམས་ལ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དང་གཞི་རབ་ཏུ་སྒྲོག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་དང་ཐབས་ཀྱི་སྙིང་པོའི་སྤྲིན་ཀུན་ཏུ་འབྱུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་རྣམས་ལ་དགའ་བར་བགྱི་བའི་མཛོད་ཤིན་ཏུ་བསྩགས་པའི་སྙིང་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡངས་པ་ལ་མོས་པ་རྣམས་ལ་རྣམ་པར་ཐར་པ་མི་ཟད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྨོན་ལམ་གྱིས་དགའ་བར་བྱེད་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། གཟུགས་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་གཞི་ཀུན་ཏུ་མི་ཟད་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ཚངས་པའི་རིས་ཀྱི་ལྷ་རྣམས་ལ་ཚུལ་རྒྱ་མཚོ་ཚད་མེད་པའི་འབྲུག་སྒྲའི་དབྱངས་ཤེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། དབང་བསྒྱུར་གྱི་ལྷ་རྣམས་ལ་སྟོབས་འབྱུང་བའི་ཆོས་ཀྱི་ཡོ་བྱད་མི་ཟད་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་རྒྱལ་མཚན་སྣ་ཚོགས་ཅན་ཡང་དག་པར་བསྒྲུབ་པའི་དབྱངས་ཤེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། འཕྲུལ་དགའི་ལྷ་རྣམས་ལ་ཡེ་ཤེས་རིན་པོ་ཆེ་སྣ་ཚོགས་ལ་བརྩོན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། དགའ་ལྡན་གྱི་ལྷ་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། མཚེ་མའི་ལྷ་རྣམས་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་རྗེས་སུ་དྲན་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་གནས་སུ་དེ་བཞིན་གཤེགས་པ་མཐོང་བས་དགེ་བའི་ཤུགས་འབྱུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོའི་གནས་སུ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ནམ་མཁའ་ལ་དེ་བཞིན་གཤེགས་པའི་གནས་རྣམ་པར་འཕྲུལ་པས་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། དྲི་ཟའི་དབང་པོའི་གནས་སུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཡང་དག་པར་བགྲོ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ལྷ་མ་ཡིན་གྱི་གནས་སུ་ཡེ་ཤེས་ཀྱི་ཚུལ་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་གནས་སུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་འབྱུང་བའི་ཐབས་ཀྱི་སྤྲིན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། མིའམ་ཅིའི་དབང་པོའི་གནས་སུ་ཆོས་ཀྱི་སྤྲིན་ཡང་དག་པར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབྱངས་ཤེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ཀླུའི་དབང་པོའི་གནས་སུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་སྒྲོག་ཅིང་སྲིད་པའི་ལམ་གྱི་རྒྱུད་ལས་སྐྱོ་བ་བསྐྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་གནས་སུ་དགའ་བ་རྒྱ་མཚོ་རྣམ་པར་འཕེལ་བར་བྱེད་པའི་ཤུགས་ཤེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། མྱིའི་གནས་སུ་འགྲོ་བ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་ཡེ་ཤེས་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། སེམས་ཅན་དམྱལ་བའི་འཇིག་རྟེན་དུ་འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བའི་དབྱངས་དང་། འཕགས་པའི་ལམ་གྱི་ཚིག་གི་རྒྱུད་ཀྱིས་བརྒྱན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་ལས་ཀྱི་ལམ་ཁ་ན་མ་ཐོ་བ་མེད་པ་ལ་ནན་ཏན་དུ་བྱ་བའི་དབྱངས་དང་། དེ་བཞིན་གཤེགས་པ་རྗེས་སུ་དྲན་པའི་སྤྲིན་གྱི་དཀྱིལ་འཁོར་གྱི་ལྷུན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒྲག་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཏོང་བའི་སེམས་འབྱུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། སེམས་ཅན་ལོག་པར་ལྟུང་བ་རྣམས་ལ་སྡུག་བསྔལ་ཐམས་ཅད་ཞི་བ་རབ་ཏུ་འཐོབ་པས་དབུགས་འབྱུང་བའི་དབྱངས་ཀྱི་ང་རོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་མཛད་ཅིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །
en: They were sending down the rain from the clouds of Dharma equally on all beings; sending down onto the bodhisattvas who had gone to the supreme bodhimaṇḍas the rain from the cloud of Dharma called the cloud of the direct knowledge of the separate bases for the complete realm of phenomena; sending down onto the bodhisattvas who had received empowerment the rain from the cloud of Dharma called the complete cloud of bases; sending down onto the bodhisattvas who had been empowered as regents of the great Dharma the rain from the cloud of Dharma called complete entry through the gateways; sending down onto the bodhisattvas who were youths the rain from the cloud of Dharma called completely adorned; sending down onto the irreversible bodhisattvas the rain from the cloud of Dharma called the summitof steadfast compassion; sending down onto the bodhisattvas with pure superior motivation the rain from the cloud of Dharma called the vajra of the knowledge of the separate natures of all phenomena; sending down onto the bodhisattvas who had accomplished practice in previous lifetimes the rain from the cloud of Dharma called the display of completely attracting beings; sending down onto the bodhisattvas who had been reborn the rain from the cloud of Dharma called the cloud of the direct perception of the circles of followers of the tathāgatas in the three times; sending down onto the bodhisattvas who were engaged in practice the rain from the cloud of Dharma called declaring the natures and bases of all phenomena; sending down onto beginner bodhisattvas the rain from the cloud of Dharma called the appearance of the cloud of the essence of method and the way great compassion; sending down onto the bodhisattvas who had developed the aspiration for enlightenment for the first time the rain from the cloud of Dharma called the essence of the accumulated treasure that brings joy; sending down onto the bodhisattvas who had vast aspiration the rain from the cloud of Dharma called the treasure that brings joy through unceasing liberations and the prayers of the tathāgatas; sending down onto the beings in the form realm the rain from the cloud of Dharma called the treasure with an unceasing basis; sending down onto the Brahmakāyika devas the rain from the cloud of Dharma called the sound of the roar of an ocean of limitless ways; sending down onto the Para­nirmita­vaśa­vartin devas the rain from the cloud of Dharma called the inexhaustible treasure of the prerequisite qualities for the arising of strength; sending down onto the devas of Māra the rain from the cloud of Dharma called the voice that acquiresthe various banners of the accumulation of omniscience; sending down onto the Nirmāṇarati devas the rain from the cloud of Dharma called dedication to various precious knowledges; sending down onto the Tuṣita devas the rain from the cloud of Dharma called the banner of the various precious prayers of the bodhisattvas; sending down onto the Yāma devas the rain from the cloud of Dharma called the treasure of being mindful of all the tathāgatas; sending down onto the abode of Śakra, the lord of the devas, the rain from the cloud of Dharma called the arising of the power of joythrough seeing the tathāgatas; sending down onto the abode of the lord of the yakṣas the rain from the cloud of Dharma called the emanations of the abodes of the tathāgatas filling the space of the realm of phenomena; sending down onto the abode of the lord of the gandharvas the rain from the cloud of Dharma called the sound of the songsof the Dharma of all the tathāgatas; sending down onto the abode of the lord of the asuras the rain from the cloud of Dharma called the vajra field of the way of wisdom; sending down onto the abode of the lord of the garuḍas the rain from the cloud of Dharma called the cloud of the method for the arising of all the tathāgatas; sending down onto the abode of the lord of the kinnaras the rain from the cloud of Dharma called the singing of the songsof all the clouds of Dharma; sending down onto the abode of the lord of the nāgas the rain from the cloud of Dharma called the miraculous resounding of the bodhisattvas that creates dismay with saṃsāra; sending down onto the abode of the lord of the mahoragas the rain from the cloud of Dharma called the power that increases an ocean of joy; sending down onto the world of humans the rain from the cloud of Dharma called the rangeof knowledge that is superior to that of all beings; sending down onto the world of the hells the rain from the cloud of Dharma called the voice that ends all the suffering of saṃsāra; sending down onto those reborn as animals the rain from the cloud of Dharma called the form of the field of the clouds of mindfulness of the tathāgatas that describes the practice of the path of irreproachable activities; sending down onto those in the world of Yama the rain from the cloud of Dharma called the proclamation of the perfections of all the tathāgatas that gives rise to generosity in the minds of all beings; and sending down onto the beings who had fallen down the rain from the cloud of Dharma called the roar of the voice that brings relief through the attainment of the cessation of all suffering.

source: བ་སྤུའི་བུ་ག་ཐམས་ཅད་ལས་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་གྱི་ཁ་དོག་དང་གཟུགས་ཀྱི་གློང་དང་རྒྱན་གྲངས་མེད་པ་ཅན་དགོས་པ་སྣ་ཚོགས་གྲངས་མེད་པ་ལ་སྟ་གོན་དུ་གནས་པ། སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས། ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་སྟེ།
en: Sudhana also saw issuing forth from all of Sāgara­dhvaja’s pores, from each of his pores, fields of networks of light rays that were as numerous as the atoms in countless buddha realms, were filling the ten directions of the realm of phenomena, and formed countless arrays of powers and adopted forms prepared to carry out countless different activities.

source: འདི་ལྟར་བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་སྦྱིན་པའི་སྤྱོད་པ་སྐྱོན་མེད་པས། བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངོ་། །
en: Sudhana saw some of the fields of networks of light rays from the pores performing the miracle of giving away all possessions through a faultless conduct of generosity.

source: བ་སྤུའི་སྒོའི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་དུས་གསུམ་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་དང་། ཡི་དམ་དང་ཚུལ་ཁྲིམས་ཀྱི་དཀྱིལ་འཁོར་དུ་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངོ་། །
en: Sudhana saw some of the fields of networks of light rays from the pores manifesting the field of the correct conduct, discipline, commitment, and precepts of the bodhisattvas of the three times.

source: བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་བཟོད་པའི་སྤྱོད་པའི་རྣམ་པ་དུས་གསུམ་དུ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྐ་ལག་དང་།
en: Sudhana saw some of the fields of networks of light rays from the pores manifesting the forms of the conduct of patience of the bodhisattvas in the three times.

source: ཡན་ལག་གི་དམ་པ་བཅད་ཀྱང་ཉམས་སུ་བཟོད་པ་བྱེད་པའི་རྣམ་པར་འཕྲུལ་པ་དང་།
en: They manifested them enduring their hands, feet, and heads being cut off.

source: ཁུ་ཚུར་དང་དབྱིག་པས་བསྣུན་ཏེ། མཚོན་གྱིས་ལུས་ལ་བཏབ་ཀྱང་ཉམས་སུ་བཟོད་པར་བྱེད་པའི་རྣམ་པར་འཕྲུལ་པ་དང་།
en: They manifested them enduring their bodies being beaten with fists and sticks and struck by weapons.

source: ལུས་ཐམས་ཅད་གཤེགས་སམ། སྙིང་དང་མྱིག་ཕྱུང་ཡང་ཉམས་སུ་བཟོད་པ་བྱེད་པའི་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངོ་། །
en: They manifested them enduring their bodies being cut apart or their hearts and eyes being plucked out.

source: བྱང་ཆུབ་སེམས་དཔའ་དུས་གསུམ་དུ་བྱུང་བ་རྣམ་པར་བརྟགས་པའི་ལུས་དང་ལྡན་པ་གཞན་དག་གིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་བཙལ་བའི་ཆེད་དུ་ལུས་དང་། སེམས་ལ་གནོད་པ་ཐམས་ཅད་དང་ཡན་ལག་དང་ཉིང་ལག་བཅད་པ་ཐམས་ཅད་ཀྱང་སྙིང་རྗེ་ཆེན་པོས་དབང་དུ་བྱས་པའི་ཕྱིར་ཉམས་སུ་བཟོད་པར་བྱས་པ་དང་། བག་ལ་ཞ་བར་བྱས་པ་དང་བཏང་སྙོམས་སུ་བཞག་པའི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་སྤྱོད་པ་རྣམ་པར་འཕྲུལ་པའི་གཟུགས་བརྙན་གྱི་གཟུགས་དེ་ལྟ་བུ་དག་ཀྱང་མཐོང་ངོ་། །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བརྩོན་འགྲུས་ཀྱི་སྤྱོད་པ་རྣམ་པ་ཐ་དད་པ་རྣམ་པར་ཕྱེ་བའི་གཟུགས་དང་། བྱང་ཆུབ་སེམས་དཔའ་འདས་པ་དང་།
en: Sudhana saw the manifestation of forms of the images of the conduct of patience of all bodhisattvas: the formed appearances of other bodhisattvas appearing in the three times who, in seeking omniscience with great compassion, were enduring, forbearing, and indifferent to physical and mental torments and to their limbs and the smaller parts of their bodies being cut off.

source: མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་འཇིག་རྟེན་ཡོངས་སུ་བསྐྱོད་པ་དང་རྒྱ་མཚོ་ཡོངས་སུ་བསྐྱོད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྐྱོ་བར་བྱ་བ་དང་། མུ་སྟེགས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚར་གཅད་པ་དང་། བདུད་ཐམས་ཅད་སྤ་དགོང་བ་དང་། ཆོས་ཀྱི་ཕྱོགས་སྣང་བར་བྱ་བའི་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་ཆེན་པོར་རྣམ་པར་འཕྲུལ་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྣམ་པར་རྒྱུ་བའི་རྣམ་གྲངས་ཇི་སྙེད་པ་དང་ལུས་ཉེ་བར་ལེན་པ་ཇི་སྙེད་པ་དང་། རིགས་སུ་སྐྱེ་བ་ཡོངས་སུ་བཟུང་བ་ཅི་སྙེད་པ་དང་། གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་གྲུབ་པ་ཇི་སྙེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་རྗེས་སུ་བསྟན་པ་ཡོངས་སུ་བཟུང་བ་ཇི་སྙེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་མན་ངག་ལ་ནན་ཏན་དུ་བྱ་བའི་གནས་ཇི་སྙེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་གྱི་ཡན་ལག་ཡོངས་སུ་བསྒྲུབ་པ་དང་། འཐུན་པའི་གཙུག་ལག་ཁང་དང་། གནས་དང་།
en: Sudhana saw some of the fields of networks of light rays from the pores manifesting the different separate forms of the conduct of diligence of all bodhisattvas: the manifestations of the diligence of the bodhisattvas of the past, future, and present making worlds tremble, agitating the oceans, causing beings to be dismayed with saṃsāra, terrifying all tīrthikas, causing the hordes of māras to flee, and illuminating the aspects of the Dharma.

source: གཞལ་མེད་ཁང་དང་། ཡུལ་དང་། རིའི་སུ་ལ་ཇི་སྙེད་པ་དང་། བསམ་གཏན་གྱི་ཡན་ལག་དེ་དག་སུས་ཡོངས་སུ་བསྒྲུབ་པའི་དྲང་སྲོང་གི་ལུས་ཇི་སྙེད་པ་དང་། རྒྱལ་པོའི་ཐབས་ཇི་སྙེད་པ་དང་། འབྱུང་བ་ལ་མངོན་པར་མོས་པ་ཇི་སྙེད་པ་དང་།
en: Sudhana also saw some of the fields of networks of light rays from the pores manifesting all the many kinds of bodhisattva conduct that are performed: all their choosing of an existence; their being born into a family; their formation of a body; their being taught by kalyāṇamitras; the locations for their practicing the instructions of the kalyāṇamitra; the temples, locations, aerial palaces, lands, or mountain caves that are favorable for the practice of the aspects of the meditation of the tathāgatas; their physical forms as ṛṣis in which they accomplish those aspects of meditation; their ruling as kings; their aspiration for renunciation; and the discipline, commitment, and precepts of their path of mendicancy.

source: བརྟུལ་ཞུགས་དང་ཡི་དམ་དང་། ཚུལ་དང་སྤྱོད་ལམ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་། །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ལ་རྣམ་པར་སྤྱོད་ཅིང་།
en: Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting the practice of the conduct of the perfection of wisdom.

source: ཆོས་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་བ་དང་ལྡན་པའི་ལུས་ཡོངས་སུ་བཟུང་བ་མཐོང་སྟེ། ལུས་གང་གིས་ཆོས་ཀྱི་ཚིག་གཅིག་གི་དོན་དུ་ཡང་བ་དོག་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལས་ཡོངས་སུ་བཙལ་བ་དང་རིམ་གྲོ་དང་། བཀུར་སྟི་ཐམས་ཅད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ལས་ཡོངས་སུ་བཙལ་བ་དང་། དད་པ་དང་སྲི་ཞུས་ལུས་རབ་ཏུ་བཏུད་དེ།
en: He saw the acquisitions of a body for seeking all the Dharma, in those bodies giving up all possessions for the sake of a single word of the Dharma, seeking that single word from all beings, seeking it from all kalyāṇamitras with service and respect, and seeking it from all the tathāgatas with faith, veneration, and bowing down the body.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ལས་ཡོངས་སུ་བཙལ་བ་དང་། ཆོས་ཀྱི་ཚིག་གཅིག་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་ཆོས་ཀྱི་ཚིག་ཐམས་ཅད་ལའང་དེ་བཞིན་ཏེ།
en: Just as they do for a single word of the Dharma, they do the same for all the words of the Dharma that have the perfection of wisdom of the tathāgatas, seeking them with the apparent image of a body appearing among all beings.

source: འགྲོ་བ་ཐམས་ཅད་དུ་གཟུགས་བརྙན་བྱུང་བའི་ལུས་ཐམས་ཅད་ཀྱི་ཡོངས་སུ་བཙལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བ་སྤུའི་སྒོ་གཅིག་གི་འོད་ཟེར་གྱི་དྲ་བ་དང་དཀྱིལ་འཁོར་ལས་མཐོང་ངོ་། །བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བ་དང་། དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཐབས་འགྲོ་བའི་རྒྱུད་རྒྱ་མཚོ་ཐམས་ཅད་དུ་འབྱམ་ཀླས་པ། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་སྦྱོར་བར་མཐོང་ངོ་། །
en: Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting the methods of all bodhisattvas for ripening beings, for gathering as pupils all beings, and he saw the entire vast extent of the ocean of beings.

source: སེམས་ཅན་རེ་རེ་ལ་ཡང་ལུས་དང་སྤྱོད་པའི་ཚུལ་གྱི་སྒོ། སྔོན་གྱི་ལུས་ཉེ་བར་བླངས་པ་ཐབས་མཁས་པའི་སྤྱོད་པ་ལ་བརྩོན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དང་འདྲ་བས་ཡོངས་སུ་སྡུད་པ་ཡང་བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་གཅིག་ལས་མཐོང་ངོ་། །
en: He saw the dedication to the conduct of skillful methods in their previous lifetimes, how they gathered pupils through having a body that was the same as that of each and every being.

source: བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་སྔོན་བཅོམ་ལྡན་འདས་ཀྱི་བསྐལ་པ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྤྱོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པའི་སྤྱོད་པ་དང་། ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབས་པ་མཛད་པ་ཇི་སྙེད་པ་དང་།
en: Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting the conduct that accomplishes the prayers of all the bhagavats in the past kalpas, the conduct that accomplishes the prayers for ripening all beings, and the conduct that accomplishes the prayers for purifying all realms.

source: སྨོན་ལམ་ཐམས་ཅད་མངོན་པར་བསྒྲུབས་པའི་དཀྱིལ་འཁོར་ཇི་སྙེད་ཅིག་དེ་བཞིན་གཤེགས་པ་དེ་དང་དེ་དག་གི་ཞབས་ཀྱི་དྲུང་དུ་འཁོར་བའི་སྐྱོན་ཐམས་ཅད་ལས་སོ་སོའི་རེ་རེའི་གཉེན་པོར་མངོན་པར་བསྒྲུབས་པར་མཛད་པ།
en: Within the field of the accomplishment of those prayers they accomplished the remedy for each fault of saṃsāra at the feet of this and that tathāgata.

source: དེ་དག་ཐམས་ཅད་ཀྱང་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་གཅིག་ལས་མཐོང་ངོ་། །
en: Sudhana, the head merchant’s son, saw all of these manifesting from each single field of networks of light rays from a pore.

source: བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཐམས་ཅད་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་མཐོང་ངོ་། །
en: Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting an ocean of all the past conduct of the perfection of strength.

source: བ་སྤུའི་སྒོའི་འོད་ཟེར་གྱི་དྲ་བའི་དཀྱིལ་འཁོར་ལ་ལ་ལས་ནི་ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་རྣམ་པར་རྒྱུ་བ་ཐམས་ཅད་དང་ལྡན་པ་མི་ཤེས་པའི་གཉིད་ཀྱིས་ལོག་པའི་སེམས་ཅན་སད་པར་བྱེད་པའི་རང་བཞིན་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་མཐོང་བར་གྱུར་ཏོ། །
en: Sudhana, the head merchant’s son, also saw some of the fields of networks of light rays from each of the pores manifesting an ocean of all the past practice of the conduct of wisdom that has the nature of awaking beings from the sleep of ignorance.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་དེ་ལྟར་མཉམ་པར་བཞག་པ་ལ་སེམས་ཤིང་རྟོག་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དེ་ལ་རྗེས་སུ་རྣམ་པར་བསམ་པ་དང་།
en: Sudhana, the head merchant’s son, thus observed and examined the bhikṣu Sāgara­dhvaja resting in meditation.

source: སེམས་ཅན་གྱི་དོན་གྱི་ཚུལ་རྒྱ་མཚོ་དེ་ལ་འཇུག་པར་བྱ་བ་དང་། མངོན་པར་འདུ་བྱ་བའི་སྒོ་རྒྱུད་ཀུན་ལ་མངོན་དུ་གནས་པའི་རྒྱན་དེའི་རྗེས་སུ་འབྲང་ཞིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་རྒྱན་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྒོ་དེ་ལ་འཇུག་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཡང་དག་པར་མནོད་པའི་ཡེ་ཤེས་དེ་ལ་རབ་ཏུ་བརྟག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དབང་གི་སྟོབས་དེ་ཡོངས་སུ་བསྐྱེད་པ་དང་།
en: He was mindful of the field of liberation of samādhi; he was contemplating the inconceivable, supreme power of bodhisattva samādhi; he was comprehending that inconceivable ocean of ways to benefit beings; he was following and was devoted to that inconceivable, complete display of the composite gateways for entry into those streams of conduct; he was entering through the gateway to the pure wisdom of the display of the realm of phenomena; he was examining the wisdom that is received through the blessing of the buddhas; he was developing the strength of those bodhisattva powers; he was making firm the strength of those bodhisattva prayers; and he was increasing the strength of that bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་སྟོབས་དེ་བརྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྟོབས་དེ་ཤིན་ཏུ་རྒྱས་པར་བྱ་བ་བྱེད་ཅིང་། དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་གྱི་མདུན་དུ་ཉིན་ཞག་གཅིག་ཀྱང་ལོན་ནོ། །
en: In that way, he sat before the bhikṣu Sāgara­dhvaja for an entire day and night.

source: ཉིན་ཞག་གཉིས་དང་བདུན་ཡང་ལོན་ནོ། །ཟླ་བ་ཕྱེད་དང་ཟླ་བ་གཅིག་དང་། ཟླ་བ་གཉིས་དང་ཟླ་བ་དྲུག་གི་བར་དང་། ཉིན་ཞག་ཀྱང་དྲུག་ཏུ་དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་གྱི་མདུན་དུ་ལོན་ཏེ།
en: He sat before the bhikṣu Sāgara­dhvaja for two days, for seven days, for half a month, for a whole month, for two months, for six months, and for another six days and nights.
